Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON LATAM_Dreaming Freedom.tmx
Source language: en
Languages: es_419

source: jeongmin choi comforts me these days since you’re not here lol
es_419: AHORA QUE USTEDES NO ESTÁN, ME CONSUELA JEONGMIN CHOI XD

source: we were just talking about it after school every day.
es_419: HABLAMOS SOBRE ESO TODOS LOS DÍAS DESPUÉS DE CLASES.

source: I’m sorry, juhyeon!
es_419: ¡LO SIENTO, JUHYEON!

source: sorry, were you surprised?
es_419: LO SIENTO, ¿ESTÁS SORPRENDIDA?

source: I feel like shit.
es_419: ME SIENTO HORRIBLE.

source: I’m going to screenshot this and send it to my phone for now...
es_419: SACARÉ UNA CAPTURA DE PANTALLA Y LA ENVIARÉ A MI TELÉFONO…

source: like you said, we’re still getting closer...
es_419: COMO TÚ MISMO DIJISTE, NO SOMOS MUY CERCANOS AÚN…

source: g-give it back!!
es_419: DA… ¡DÁMELO!

source: ...and it’s not like what we said was wrong.
es_419: … Y LO QUE DIJIMOS NOSOTRAS NO ESTUVO MAL.

source: oh?
es_419: ¿EH?

source: alright, let’s start stretching.
es_419: BIEN, EMPIECEN A ESTIRAR.

source: let’s go to the bathroom, jeongmin!
es_419: ¡VAMOS, JEONGMIN!

source: what? how could I force myself to deal with hyejin...?
es_419: ¿QUÉ? ¿CÓMO PODRÍA OBLIGARME A ESTAR CON HYEJIN…?

source: as if it wasn’t enough that you took pictures of me without asking...
es_419: COMO SI NO FUERA SUFICIENTE CON QUE ME TOMES FOTOS SIN PERMISO…

source: you’re afraid you’ll be alone?
es_419: ¿TIENES MIEDO DE ESTAR SOLA?

source: there was this time juhyeon didn’t come to school because she was mysteriously hurt in her sleep.
es_419: UNA VEZ, JUHYEON NO FUE A LA ESCUELA PORQUE LA HIRIERON MISTERIOSAMENTE MIENTRAS DORMÍA.

source: I won’t let anything bad happen to you.
es_419: NO DEJARÉ QUE TE PASE NADA MALO.

source: you can’t even say anything to me directly.
es_419: NI SIQUIERA PUEDES DECÍRMELO A LA CARA.

source: I have to stop...
es_419: TENGO QUE CALLARME…

source: get ready for your next class.
es_419: PREPÁRENSE PARA LA SIGUIENTE CLASE.

source: I think the rest of my class isn’t interested in me anymore.
es_419: PARECE QUE MIS OTRAS COMPAÑERAS YA NO SE INTERESAN EN MÍ.

source: can we go somewhere?
es_419: ¿PODEMOS IR A OTRA PARTE?

source: it’s unfair that I’m the only one who doesn’t know what kind of person he is.
es_419: NO ES JUSTO QUE YO NO SEPA QUÉ CLASE DE PERSONA ES ÉL.

source: why did I talk about that...
es_419: POR QUÉ HABLÉ SOBRE ESO…

source: I remember what he said the first time we met...
es_419: RECUERDO LO QUE DIJO LA PRIMERA VEZ QUE NOS VIMOS…

source: yeah!
es_419: ¡SÍ!

source: they were half right... and half wrong.
es_419: PARTE DE ESO ERA CIERTO… Y PARTE NO.

source: can you wait until then?
es_419: ¿NO PUEDES ESPERAR HASTA ENTONCES?

source: how...?
es_419: ¿CÓMO…?

source: I-I’m sorry...
es_419: LO SIENTO…

source: he said that jaehyeok would come back to normal soon, but...
es_419: DIJO QUE JAEHYEOK VOLVERÍA PRONTO A LA NORMALIDAD, PERO…

source: why don’t you ever understand what I’m saying?! you’re so annoying!!
es_419: ¡¿POR QUÉ NO ENTIENDES LO QUE TE DIGO?! ¡QUÉ PESADO ERES!

source: I might not have time starting next week.
es_419: A PARTIR DE LA SEMANA QUE VIENE, QUIZÁS NO PUEDA SALIR TANTO.

source: that was what attracted me to you.
es_419: ESO ES LO QUE ME ATRAJO DE TI.

source: that’s a relief!
es_419: ¡QUÉ ALIVIO!

source: sora, did you see this online?
es_419: ¿VISTE ESTO, SORA?

source: do you understand?!
es_419: ¡¿ENTENDIDO?!

source: all I could do was think that to myself.
es_419: SOLO PUDE PENSAR EN ESO.

source: once you’re done shopping, let’s go eat dinner.
es_419: DESPUÉS DE COMPRAR, VAYAMOS A COMER ALGO.

source: you want to come too?
es_419: ¿TÚ TAMBIÉN QUIERES VENIR?

source: haeun im? are you free for a minute?
es_419: ¿HAEUN IM? ¿TIENES UN MINUTO?

source: I have time...
es_419: TENGO TIEMPO…

source: you didn’t do anything to warrant her doing this.
es_419: TÚ NO HICISTE NADA PARA MERECER ESTO…

source: my friends will be there, too...
es_419: MIS AMIGAS ESTARÁN TAMBIÉN…

source: he looked pretty handsome and popular,
es_419: ERA APUESTO Y PARECÍA POPULAR,

source: you made the vibes weird all the time, and I barely stopped everyone from making you an outcast.
es_419: POR TU CULPA, LA SITUACIÓN SIEMPRE SE PONÍA INCÓMODA; APENAS PUDE DETENER A QUIENES QUERÍAN DEJARTE DE LADO.

source: I don’t think the chances are nonexistent.
es_419: Y NO ES ALGO IMPOSIBLE TAMPOCO.

source: I’m doing all of this...
es_419: ESTOY HACIENDO ESTO…

source: anyways.
es_419: EN FIN…

source: not at all! why are you apologizing?
es_419: ¡PARA NADA! ¿POR QUÉ ME PIDES DISCULPAS?

source: I can’t let you be the only one to see the looks of pain on my tormentors’ faces.
es_419: NO PUEDO DEJAR QUE SEAS EL ÚNICO QUE VEA EL DOLOR EN SUS ROSTROS.

source: what’s really pathetic is that...
es_419: PERO LO PATÉTICO ES QUE…

source: but there’s nothing I want to hear from her...
es_419: PERO NO QUIERO QUE ME DIGA NADA.

source: the more upset I got, the greater of an outcast I’d become in my class.
es_419: EL PROBLEMA ES QUE, MIENTRAS MÁS ME ENOJO, MÁS ME AÍSLAN EN CLASE…

source: but i think jeongmin is gonna fall for my trap if i butter her up a little lol
es_419: PERO CREO QUE JEONGMIN CAERÁ EN MI TRAMPA SI ME HAGO LA BUENITA CON ELLA XD

source: I noticed it as soon as I saw her...
es_419: ME DI CUENTA APENAS LA VI…

source: ...of what juhyeon ha's clique would do to me.
es_419: … DE LO QUE ME HARÍA EL GRUPO DE JUHYEON.

source: there’s something I’ve always wanted to ask you.
es_419: HACE MUCHO TIEMPO QUE QUIERO PREGUNTARTE ALGO.

source: how do you know that?!
es_419: ¡¿CÓMO LO SABES?!

source: okay, I’ll be there.
es_419: AHORA VOY.

source: did eunju go off on you again lmao
es_419: EUNJU SE ENOJÓ OTRA VEZ CONTIGO? XD

source: I can’t believe the atmosphere at home could change so much just because my dad is gone...
es_419: ES INCREÍBLE QUE EL AMBIENTE EN CASA CAMBIE TANTO SOLO PORQUE PAPÁ SE FUE.

source: You can follow me on Instagram or Twitter.
es_419: Me pueden seguir en Instagram o en Twitter.

source: let’s go.
es_419: VAMOS.

source: I’m gonna retrace my steps!
es_419: ¡VOY A VOLVER POR DONDE VINE!

source: jeongmin, don’t hang out with juhyeon anymore.
es_419: JEONGMIN, DEJA DE JUNTARTE CON JUHYEON.

source: ...no one here uses me and makes me look like a bad person.
es_419: AQUÍ NADIE ME USA Y ME HACE QUEDAR MAL.

source: you said you don’t think you’re all that, but you’re the best person I’ve ever met.
es_419: DICES QUE NO ERES LA GRAN COSA, PERO ERES LA MEJOR PERSONA QUE HE CONOCIDO.

source: if you pull any funny business, I’m going to show this to the whole class.
es_419: SI TE PASAS DE LISTA, SE LO MOSTRARÉ A TODA LA CLASE.

source: they seemed to enjoy it...
es_419: PARECÍA GUSTARLES…

source: ...with white hair.
es_419: … DE CABELLO BLANCO.

source: I let my guard down...
es_419: ME DESCUIDÉ…

source: if we’re all going to hang out together, you guys will feel more comfortable around jeongmin than eunju.
es_419: SI PASAMOS TIEMPO JUNTAS, SE SENTIRÁN MÁS CÓMODAS CON JEONGMIN QUE CON EUNJU.

source: how could you do this to me...?
es_419: ¿CÓMO PUDIERON HACERME ESTO…?

source: I wasn’t thinking straight.
es_419: NO PENSÉ BIEN LAS COSAS.

source: I guess it really won’t work...
es_419: PARECE QUE NO FUNCIONÓ…

source: you know you’re totally different from her, right?
es_419: SABES QUE ELLA Y TÚ SON MUY DIFERENTES, ¿NO?

source: but I don’t want to do that.
es_419: PERO YO NO QUIERO QUE PASE ESO.

source: gasp! you did?
es_419: ¡AHH! ¿EN SERIO?

source: honestly, I’m scared of juhyeon...
es_419: EN REALIDAD, JUHYEON ME DA MIEDO…

source: I know that...
es_419: LO SÉ…

source: are you really on my side?
es_419: ¿ESTÁS REALMENTE DE MI LADO?

source: then?
es_419: ¿ENTONCES?

source: jeongmin was probably sick of it...
es_419: SUPONGO QUE JEONGMIN SE HARTÓ.

source: F U
es_419: PÚDRETE

source: that’s all for today’s class.
es_419: ESO ES TODO POR HOY.

source: she got angry about jeongmin and now she’s acting all friendly again.
es_419: SE MOLESTÓ POR JEONGMIN Y AHORA SE COMPORTA COMO SI NO PASARA NADA.

source: juhyeon has done so much to you.
es_419: JUHYEON TE HIZO MUCHO YA.

source: ...but why is she acting all nice like she did at first?
es_419: … ¿PERO POR QUÉ ES TAN AMABLE COMO AL PRINCIPIO?

source: our classmates became less hostile toward me.
es_419: NUESTRAS COMPAÑERAS YA NO ME MOLESTARON TANTO.

source: you have no idea how bad eunju felt after you left.
es_419: CUANDO TE FUISTE, EUNJU ESTABA MUY MAL.

source: hey, hang up!
es_419: ¡CORTA LA LLAMADA!

source: what the hell?
es_419: ¿QUÉ DEMONIOS…?

source: this is the best reaction I’ve gotten.
es_419: ES LA MEJOR REACCIÓN QUE VI HASTA AHORA.

source: what’s wrong...?
es_419: ¿QUÉ SUCEDE…?

source: is this okay...?
es_419: ¿ESTÁ BIEN…?

source: yeah... remember the guy I couldn’t play video games with because I was talking to you?
es_419: SÍ… ¿RECUERDAS EL CHICO CON EL QUE NO PUDE JUGAR PORQUE ESTABA CONTIGO?

source: hey, you know that was really creepy just now, right?
es_419: OYE, ESO QUE DIJISTE ESTÁ MUY MAL, ¿SABES?

source: ...but juhyeon actually started telling us not to hang out with you recently.
es_419: … PERO, HACE POCO, JUHYEON NOS PIDIÓ QUE NO NOS JUNTÁRAMOS CONTIGO.

source: ah, I get it.
es_419: AH, YA VEO.

source: I believed...
es_419: CREÍ QUE…

source: what’s wrong with jeongmin, seriously?
es_419: ¿QUÉ LE PASA A JEONGMIN? DIOS MÍO…

source: I’ll make you look pretty.
es_419: TE DEJARÉ HECHA UNA DIOSA.

source: ...it’s best not to get involved with him in any way!!
es_419: ¡… SERÁ MEJOR QUE NO ME ACERQUE A ÉL!

source: what’s this, all of a sudden? is something fun about to happen?
es_419: ¿QUÉ QUIERE AHORA? ¿ESTÁ POR OCURRIR ALGO INTERESANTE?

source: surprisingly, I don’t say things I don’t mean
es_419: QUIZÁ TE SORPRENDA, PERO SOLO DIGO LAS COSAS QUE QUIERO DECIR

source: who is he?
es_419: ¿QUIÉN ES?

source: ugh, eat bricks.
es_419: BAH, VETE A LA MIERDA.

source: it’s all right...
es_419: ESTÁ BIEN…

source: whether you were asking because you already knew me or not,
es_419: NO IMPORTA SI LO PREGUNTAS PORQUE YA LO SABES O NO.

source: ...she doesn’t have any friends or family who’d even be interested in her private life.
es_419: … NO TIENE AMIGOS NI FAMILIARES QUE SE PREOCUPEN POR SU VIDA PRIVADA.

source: to tell you the truth...
es_419: PARA SERTE SINCERA…

source: but it’s not just a cute cartoon!
es_419: ¡PERO ES MÁS QUE UNA CARICATURA TIERNA!

source: appear
es_419: APARECE

source: it’s none of my business whether you have friends or not,
es_419: A MÍ NO ME IMPORTA SI TIENES AMIGAS O NO.

source: I wasn’t whining!!
es_419: ¡NO ME ESTABA QUEJANDO!

source: hmm... not exactly...
es_419: MMM… NO REALMENTE…

source: that’s what you said to her before.
es_419: ES LO MISMO QUE LE DIJISTE TÚ.

source: what if everyone thinks I’m weird...?
es_419: ¿Y SI PIENSAN QUE SOY RARA…?

source: no way.
es_419: NO PUEDE SER.

source: fine then.
es_419: ESTÁ BIEN.

source: let’s go home together, too.
es_419: VOLVAMOS A CASA JUNTOS TAMBIÉN.

source: what did I do that was so wrong?
es_419: ¡¿QUÉ HICE QUE FUE TAN TERRIBLE?!

source: ...you should have been nicer to me.
es_419: … TENDRÍAS QUE HABER SIDO MÁS AMABLE CONMIGO.

source: she just got yelled at for sleeping in class. maybe she’s a slow learner?
es_419: YA LE LLAMARON LA ATENCIÓN POR DORMIR EN CLASE. QUIZÁS LE CUESTA ENTENDER…

source: here’s my math notebook.
es_419: AQUÍ TIENES MI CUADERNO.

source: you always talk like you’re looking down on everyone.
es_419: SIEMPRE HABLAS COMO SI FUERAS MEJOR QUE TODOS.

source: since it happens in their dreams, there are no traces or prints left behind.
es_419: COMO SUCEDE EN SUS SUEÑOS, NO QUEDAN RASTROS NI HUELLAS.

source: after school, let’s go--
es_419: DESPUÉS DE LA ESCUELA, VAMOS A…

source: what if it was an effect of my lucid dreams?
es_419: ¿PODRÍA SER UN EFECTO DE MIS SUEÑOS LÚCIDOS?

source: and now she’s cut me off...
es_419: Y ME DEJÓ DE LADO…

source: how do you feel?
es_419: ¿CÓMO TE SIENTES?

source: I’m going to go to the bathroom with my friends.
es_419: VOY AL BAÑO CON MIS AMIGAS.

source: you said that you were close with her.
es_419: DIJISTE QUE SE CONOCEN BIEN.

source: because everyone I’ve ever introduced you to hates you!
es_419: ¡PORQUE TODAS LAS PERSONAS QUE TE PRESENTÉ AHORA TE ODIAN!

source: what are you, her handmaiden?
es_419: ¿ERES SU SIRVIENTA O ALGO ASÍ?

source: jeongmin is really evil.
es_419: JEONGMIN ES MUY MALA.

source: ...she’s one of juhyeon ha’s worshippers, so don’t trust her too much.
es_419: … ADORA A JUHYEON. NO CONFÍES DEMASIADO EN ELLA.

source: I would have to experiment to find out.
es_419: TENDRÍA QUE EXPERIMENTAR PARA AVERIGUARLO.

source: gasp!!
es_419: ¡AHH!

source: there are a lot of people in this bathroom...
es_419: ESTE BAÑO ESTÁ LLENO DE GENTE…

source: when did it get so late...?
es_419: ¿CUÁNDO SE HIZO ESTA HORA…?

source: jeongmin told us everything!
es_419: ¡ELLA NOS CONTÓ TODO!

source: looks like I won’t be bored on my way to school, thanks to you.
es_419: GRACIAS A TI, PARECE QUE NO ME ABURRIRÉ DE CAMINO A LA ESCUELA.

source: seeing the looks on their faces makes life worth living these days.
es_419: LAS CARAS QUE PONEN HACEN QUE VALGA LA PENA ESTAR VIVA.

source: I switched up?
es_419: ¿QUE TE TRAICIONÉ?

source: ...I have to tell this to jeongmin?
es_419: ¿TENGO QUE DECIRLE ESTO A JEONGMIN?

source: it’s so tiring to be stuck between you two, seriously!!
es_419: ¡ES AGOTADOR ESTAR CON USTEDES DOS!

source: I wouldn’t even complain if she was studying law or something.
es_419: NO ME QUEJARÍA SI ESTUDIARA LEYES O ALGO ASÍ.

source: lol why do you have to hang out with people like them...
es_419: JAJA NO ENTIENDO POR QUÉ PASAS TIEMPO CON ESA GENTE…

source: I didn’t mean anything weird, I just--!
es_419: ¡NO QUISE DECIR NADA RARO, SOLO QUE…!

source: losers like that think they’re actually somebody if you talk to them enough.
es_419: SI HABLAS UN POCO CON ELLAS, LAS PERDEDORAS SE CREEN ALGUIEN IMPORTANTE.

source: absolutely not!
es_419: ¡NO PUEDES, NI LO SUEÑES!

source: I don’t think you like it when I tell you what to do, anyway.
es_419: DE TODAS FORMAS, NO TE GUSTA QUE TE DIGA QUÉ HACER, ¿NO?

source: I heard the two of you have been friends since you were little!
es_419: ¡OÍ QUE SON AMIGAS DESDE MUY CHICAS!

source: let’s talk about the details in person.
es_419: MEJOR HABLEMOS EN PERSONA.

source: I feel better again when I talk to you.
es_419: ME SIENTO MEJOR CUANDO HABLO CONTIGO.

source: we’re going to be seeing each other for a while...
es_419: YA QUE NOS VEREMOS BASTANTE,

source: where is this?
es_419: ¿DÓNDE ESTOY?

source: you’re still sitting? get up!
es_419: ¿AÚN ESTÁS SENTADA? ¡LEVÁNTATE!

source: no one woke me up...?
es_419: ¿NADIE ME DESPERTÓ…?

source: so? what is it that you wanted to say?
es_419: ¿QUÉ QUERÍAS DECIRME?

source: they do that as well.
es_419: ELLAS TAMBIÉN.

source: i’m so annoyed lol
es_419: ESTOY MOLESTA XD

source: they must have really cut things off for good.
es_419: DEBEN HABER TERMINADO SU AMISTAD DEFINITIVAMENTE.

source: what is it? did you two fight?
es_419: ¿DE QUÉ SE TRATA? ¿DISCUTIERON?

source: that’s so mean...
es_419: QUÉ MALA ES…

source: all right, that’s all for today’s class.
es_419: BIEN, ESO ES TODO POR HOY.

source: there was a good reason for it.
es_419: HUBO UN BUEN MOTIVO PARA QUE NOS ALEJÁRAMOS.

source: what’s your name...?
es_419: ¿CÓMO TE LLAMAS…?

source: dazed
es_419: SORPRENDIDO

source: they never wanted to be genuine to me in the first place.
es_419: JAMÁS TUVIERON INTENCIONES DE SER HONESTAS CONMIGO.

source: wait!
es_419: ¡ESPERA!

source: I said it before I realized what I was doing.
es_419: LO DIJE SIN PENSAR.

source: juhyeon has a bad personality, though.
es_419: JUHYEON HA TIENE MAL CARÁCTER.

source: don’t we have to wake her up?
es_419: ¿DEBERÍAMOS DESPERTARLA?

source: yeah, we’re on your side!
es_419: SÍ, ¡ESTAMOS CONTIGO!

source: ...juhyeon returned to school in no time.
es_419: … JUHYEON VOLVIÓ A LA ESCUELA ENSEGUIDA.

source: have you never realized what people would think of that?
es_419: ¿NUNCA TE DISTE CUENTA DE LO QUE PIENSA LA GENTE SOBRE ESO?

source: it’s like she’s from a different world than me.
es_419: PARECE SALIDA DE OTRO MUNDO.

source: with the way I feel right now, I could just get revenge on her outright...
es_419: POR CÓMO ME SIENTO AHORA, PODRÍA VENGARME DE ELLA DIRECTAMENTE…

source: just...
es_419: SOLO…

source: what...? why is this...
es_419: ¿QUÉ? ¿POR QUÉ TODO ESO…

source: I must have been out of it for a second.
es_419: CREO QUE SE ME CRUZARON LOS CABLES POR UN MOMENTO…

source: I have my pride...
es_419: TENGO QUE PROTEGER MI ORGULLO.

source: she said that even though she was hurt by you in the past,
es_419: DIJO QUE, AUNQUE ESTABA DOLIDA POR LO QUE LE HABÍAS HECHO,

source: even though your personality was crap, I guess I still felt guilty about cutting you off.
es_419: AUNQUE TUVIERAS UN CARÁCTER HORRIBLE, SUPONGO QUE ME SENTÍA CULPABLE POR HABER DEJADO DE HABLARTE.

source: I wish you’d all disappear.
es_419: ¿POR QUÉ NO DESAPARECEN TODAS?

source: I was right there.
es_419: ESTUVE AHÍ.

source: ah, we have to go this way.
es_419: NOSOTRAS VAMOS POR AQUÍ.

source: "I can't do it myself."
es_419: "NO PUEDO HACERLO YO".

source: go to the empty classroom with hyejin and get a desk--
es_419: ACOMPAÑA A HYEJIN AL SALÓN VACÍO Y TOMEN UN PUPITRE…

source: what’s this?
es_419: ¿QUÉ ES ESTO?

source: ...so that you can truly be free.
es_419: … PARA QUE REALMENTE PUEDAS SER LIBRE.

source: she’s gonna get bitched out by the gym teacher later.
es_419: EL PROFESOR DE GIMNASIA LE DIRÁ DE TODO.

source: that sounds so good omg
es_419: QUÉ RICO OMG!

source: you’re flustered because your dream isn’t doing what you want, right?
es_419: TE CUESTA ENTENDER POR QUÉ TU SUEÑO NO TE HACE CASO, ¿VERDAD?

source: you’ll be by my side whenever something bad happens to me, right?
es_419: SIEMPRE ESTARÁS A MI LADO CUANDO ME PASE ALGO MALO, ¿NO?

source: hey! quiet down...!
es_419: ¡OYE! ¡SILENCIO…!

source: did you hear?
es_419: ¿TE ENTERASTE?

source: I can’t focus at all...
es_419: NO PUEDO CONCENTRARME…

source: you’re out of my league.
es_419: NO ESTOY A TU NIVEL.

source: don’t worry about it anymore.
es_419: NO TE PREOCUPES.

source: go inside, you’ll be late.
es_419: DEBERÍAS ENTRAR ANTES DE QUE SE TE HAGA TARDE.

source: to him, it definitely sounds like I’m just asking for comfort...
es_419: ÉL SEGURAMENTE PIENSE QUE LE ESTOY PIDIENDO QUE ME CONSUELE…

source: yeah, she acts all tough and treats people badly.
es_419: ¡SÍ! SE HACE LA DURA Y TRATA MAL A LA GENTE.

source: see you tomorrow.
es_419: HASTA MAÑANA.

source: ah... this is so annoying...
es_419: AH… NO SOPORTO ESTO…

source: don’t just gloss over it!
es_419: ¡NO ESQUIVES LA PREGUNTA!

source: will they think it’s their punishment for daring to do all of those things to me?
es_419: ¿LO TOMARÁN COMO UN CASTIGO POR HABERSE ATREVIDO A HACERME TODO LO QUE ME HICIERON?

source: why can’t I do the same?
es_419: ¿POR QUÉ YO NO PUEDO HACER LO MISMO?

source: t-that scared me...
es_419: AY, ME ASUSTÉ…

source: hyejin, are you here?
es_419: ¿ESTÁS AQUÍ, HYEJIN?

source: I didn’t believe them.
es_419: NO LES CREÍ.

source: I don’t have much time left, so I should start heading back to jeongmin...
es_419: NO TENGO MUCHO TIEMPO. DEBERÍA VOLVER CON JEONGMIN.

source: I’m pretending like I can’t help but go along...
es_419: HAGO DE CUENTA QUE NO TENGO OTRA OPCIÓN…

source: you didn’t know? she loves juhyeon.
es_419: ¿NO LO SABÍAS? AMA A JUHYEON.

source: it’s hard to know the details when I have to hear it from someone who heard from someone else...
es_419: ES DIFÍCIL ENTERARSE DE LOS DETALLES CUANDO ME LO CUENTA ALGUIEN QUE LO OYÓ DE BOCA DE OTRA PERSONA.

source: ...because I felt guilty about killing someone?
es_419: … POR LA CULPA QUE SENTÍ TRAS HABER MATADO A ALGUIEN?

source: keep trying to talk down at us.
es_419: SIGUE HABLÁNDONOS MAL.

source: why are you asking me?
es_419: ¿POR QUÉ ME PREGUNTAS A MÍ?

source: we’ll be back. wait at your desk!
es_419: YA VOLVEMOS. ¡ESPÉRANOS EN TU PUPITRE!

source: am I not your friend?
es_419: ¿YO NO SOY TU AMIGA?

source: I’ll do it...
es_419: LO HARÉ…

source: there’s no one on your side.
es_419: ESTÁS COMPLETAMENTE SOLA.

source: that moment of silence...
es_419: ESE MOMENTO DE SILENCIO…

source: we have to get in line early, so let’s go now.
es_419: TENEMOS QUE HACER PRONTO LA FILA, ASÍ QUE NO PERDAMOS TIEMPO.

source: I brought sora and hyejin onto my side...
es_419: SORA Y HYEJIN ESTABAN DE MI LADO...

source: is it my fault you’re alone?
es_419: ¿ES MI CULPA QUE ESTÉS SOLA?

source: I like americanos!
es_419: ¡ME GUSTA EL AMERICANO!

source: she’s the one who bullied me in grade school.
es_419: ES LA QUE ME HIZO BULLYING EN PRIMARIA.

source: do I have to hear this kind of thing just because I didn’t shower for one day?
es_419: ¿TENGO QUE ESCUCHAR ESTO SOLO PORQUE UN DÍA NO ME DUCHÉ?

source: I-I see...
es_419: YA VEO…

source: ...I’m not doing anything wrong.
es_419: … NO ESTARÉ HACIENDO NADA MALO.

source: she’s so simple, haha...
es_419: QUÉ SIMPLONA ES, JA, JA…

source: everything is annoying.
es_419: YA NO SOPORTO TODO ESTO

source: it’s the end of the day...?
es_419: ¿YA TERMINÓ EL DÍA…?

source: if my reputation was so important to me...
es_419: SI ME IMPORTARA TANTO MI REPUTACIÓN…

source: actually...
es_419: EN REALIDAD…

source: look at her.
es_419: MÍRALA…

source: was that about us just now?
es_419: ¿HABLABA DE NOSOTROS?

source: do I have to beat some sense into you again?!
es_419: ¡¿TENGO QUE ENSEÑARTE A LOS GOLPES OTRA VEZ?!

source: did something happen?
es_419: ¿PASÓ ALGO?

source: you’re crying over just something that happened in grade school...?
es_419: ¿LLORAS POR ALGO QUE PASÓ CUANDO ESTÁBAMOS EN PRIMARIA…?

source: of course, haha. you’re just getting your money back, why wouldn’t that be okay?
es_419: POR SUPUESTO. JA, JA. SOLO TE ESTARÍA DEVOLVIENDO LO QUE TE DEBO. ¿QUÉ HAY DE MALO?

source: isn’t it so annoying how she always just acts all cool behind me and only ever says what she wants to say?
es_419: ¿NO TE PARECE INSOPORTABLE QUE SE HAGA LA BUENITA A MIS ESPALDAS Y SIEMPRE DIGA LO QUE LE DA LA GANA?

source: I mean...
es_419: ES DECIR…

source: do you know how scary the vibes are right now?
es_419: ¿TIENES IDEA DE LO RARO QUE ESTÁ TODO ÚLTIMAMENTE?

source: in the end, you’ve become alone?
es_419: ¿AHORA TE QUEDASTE SOLA?

source: why would people like you have listened to juhyeon?
es_419: ¿POR QUÉ LE HICIERON CASO A JUHYEON?

source: oh, also...
es_419: AH, UNA COSA MÁS…

source: fine, stop crying.
es_419: BIEN, DEJA DE LLORAR.

source: woozy
es_419: ATONTADA

source: you should take this chance to bring her onto your side.
es_419: DEBERÍAS APROVECHAR PARA PONERLA DE TU LADO.

source: that was good just now.
es_419: ESTUVISTE MUY BIEN.

source: maybe it’d be better if she was trying to get closer to us,
es_419: TAL VEZ SERÍA MEJOR SI ELLA INTENTARA CONOCERNOS MEJOR,

source: my high school career was screwed.
es_419: MI PASO POR LA PREPARATORIA ESTABA ARRUINADO.

source: d-dad...
es_419: PAPÁ…

source: there are at least 10 people who have been used by sora choi.
es_419: SORA CHOI, POR LO MENOS, MANIPULÓ A 10 PERSONAS.

source: you did?
es_419: ¿SÍ?

source: I’d rather die than let that happen!
es_419: ¡PREFIERO MORIR ANTES DE QUE PASE ESO!

source: get the hell away from me!
es_419: ¡NO TE ME ACERQUES!

source: oh, eunju! are you coming back from the bathroom?
es_419: ¡AH, EUNJU! ¿VUELVES DEL BAÑO?

source: what?!
es_419: ¡¿QUÉ?!

source: I’ll be on your side.
es_419: YO ESTOY DE TU LADO.

source: I never outcast her or bullied her.
es_419: NUNCA LA AISLÉ NI LE HICE BULLYING.

source: there are a lot of them...
es_419: SON DEMASIADAS…
